InformationRegisters/ВычетыПоДоходамНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ВычетыПоДоходамНДФЛ</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГодовойВычет</Name>
					<Comment>Сумма вычета по коду дохода за год</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативЗатрат</Name>
					<Comment>Норматив затрат в процентах от суммы дохода по авторским вознаграждениям, размер вычета по каждому случаю выплаты иных доходов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВычетыПоДоходамНДФЛ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение сведений.
Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВычетыПоДоходамНДФЛ();
	
КонецПроцедуры

// Выполняет заполнение справочника "ВидыДоходовНДФЛ".
//
Процедура ЗаполнитьВычетыПоДоходамНДФЛ()
	
	ВидыДоходовНДФЛ = Справочники.ВидыДоходовНДФЛ;
	
	// РАЗМЕРЫ СКИДОК К ДОХОДАМ
	
	НаборЗаписей = РегистрыСведений.ВычетыПоДоходамНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	// 4D:ERP для Беларуси, Анна, 09.06.2017 16:59:58 
	// РС "Размер вычетов подоходного налога", №15136
	// Добавить размеры годовых вычетов за 2018 год в спр. "Виды доходов по подоходному налогу", № 17439
	// {
	ДатаСведений = '20170101';
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код500,           1678,  0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код500иныеорг,    111,   0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код501,           11102, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код502,           336,   0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код503,           2874,  0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код504, 		     705,   0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код163118,        5555,  0);
	
	ДатаСведений = '20180101';
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код500,           1859,  0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код500иныеорг,    123,   0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код501,           12301, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код502,           372,   0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код503,           3184,  0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код504, 		     781,   0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код163118,        6155,  0);
	// }
	// 4D
	
	// Запишем набор записей в режиме добавления.
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры 

// Добавляет запись в набор записей регистра "ВычетыПоДоходамНДФЛ".
//
Процедура ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, КодДохода, ГодовойВычет, НормативЗатрат) 

	НоваяЗапись = НаборЗаписей.Добавить();

	НоваяЗапись.Период         = ДатаСведений;
	НоваяЗапись.КодДохода      = КодДохода;
	НоваяЗапись.ГодовойВычет   = ГодовойВычет;
	НоваяЗапись.НормативЗатрат = НормативЗатрат;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
